CSCI112/org/[03]assign-3.org
Student Name: Yahia Hany Gaber | Student ID: 231000412

* Assignment #3

** Question 1: Switch Calculator

A calculator using switch statments.

#+begin_src C 

#include <stdio.h>

int main() {

  char op;
  float a, b, out;

  printf("Enter operation, num1, num2:\n");
  scanf("%c %d %d", &op, &a, &b);

  switch(op) {

    case '+':

      out = (a + b);
      break;

    case '-':

      out = (a - b);
      break;

    case '*':

      out = (a * b);
      break;

    case '/':

      out = (a / b);
      break;

  }

  printf("Result: %.2f", out);

  return 0;
}

#+end_src 

** Question 2: Sum of Even

A program to find the sum of even numbers in a specific range.

#+begin_src C 

#include <stdio.h>

int main() {

  int n, sum = 0, x = 2;

  printf("Enter limit: ");
  scanf("%d", n);

  while (x <= n) {

    sum += x;
    x+= 2;
  }

  printf("The sum of even numbers: %d", sum);

  return 0;
}

#+end_src

** Question 3: Triangle Pattern

A program to print out a triangle with a certain number of rows.

#+begin_src C 

#include <stdio.h>
#define new printf("\n")

int main() {

  int n;

  printf("Enter the number of rows: ");
  scanf("%d", &n);

  for (int x = 0; x <= n; x++, new) {

    for (int y = 0; y <= x; y++) {

      printf("*");
    }
  }

  return 0;
}

#+end_src

** Question 4: Fibonacci Sequence

A program to print the first ~n~ numbers of the fibonacci sequence.

#+begin_src C 

#include <stdio.h>

int main() {

  int n;

  printf("Enter n: ");
  scanf("%d", &n);

  int start = 0, mid = 1, end = 0;

  printf("0, 1, ");
  for (int x = 3; x <= n; x++) {

    end = (start + mid);
    start = mid; mid = end;

    if (x != n) {

      printf("%d, ", end);
    }
    else {

      printf("%d\n", end);
    }
  }
  return 0;
}

#+end_src

** Question 5: Sum of Numbers

A program that splits an integer into each separate digit and sums them up.

#+begin_src C 

#include <stdio.h>

int main() {

  int n, sum = 0, div = 10;
  float fac;

  printf("Enter a number: ");
  scanf("%d", &n);

  while (n > 0) {

    fac = (n % div);
    sum += fac;
    n /= 10;
  }

  printf("The sum of digits is: %d\n", sum);

  return 0;
}

#+end_src

