CSCI112/HTML/[03]assign-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-07 Thu 14:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Yahia Gaber" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org26cd677">1. Assignment #3</a>
<ul>
<li><a href="#org399e3c1">1.1. Question 1: Switch Calculator</a></li>
<li><a href="#org0f26840">1.2. Question 2: Sum of Even</a></li>
<li><a href="#orgb0094ff">1.3. Question 3: Triangle Pattern</a></li>
<li><a href="#org374c0bb">1.4. Question 4: Fibonacci Sequence</a></li>
<li><a href="#orgcc38f76">1.5. Question 5: Sum of Numbers</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Student Name: Yahia Hany Gaber | Student ID: 231000412
</p>
<div id="outline-container-org26cd677" class="outline-2">
<h2 id="org26cd677"><span class="section-number-2">1.</span> Assignment #3</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org399e3c1" class="outline-3">
<h3 id="org399e3c1"><span class="section-number-3">1.1.</span> Question 1: Switch Calculator</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A calculator using switch statments.
</p>

<div class="org-src-container">
<pre class="src src-C">
<span style="color: #ebdbb2; font-weight: bold;">#include</span> <span style="color: #fe8019;">&lt;</span><span style="color: #b8bb26;">stdio.h</span><span style="color: #fe8019;">&gt;</span>

<span style="color: #fabd2f;">int</span> <span style="color: #b8bb26;">main</span><span style="color: #fe8019;">()</span> <span style="color: #fe8019;">{</span>

  <span style="color: #fabd2f;">char</span> <span style="color: #83a598;">op</span>;
  <span style="color: #fabd2f;">float</span> <span style="color: #83a598;">a</span>, <span style="color: #83a598;">b</span>, <span style="color: #83a598;">out</span>;

  printf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"Enter operation, num1, num2:\n"</span><span style="color: #cc241d;">)</span>;
  scanf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"%c %d %d"</span>, &amp;op, &amp;a, &amp;b<span style="color: #cc241d;">)</span>;

  <span style="color: #fb4934;">switch</span><span style="color: #cc241d;">(</span>op<span style="color: #cc241d;">)</span> <span style="color: #cc241d;">{</span>

    <span style="color: #fb4934;">case</span> <span style="color: #b8bb26;">'+'</span>:

      out = <span style="color: #b8bb26;">(</span>a + b<span style="color: #b8bb26;">)</span>;
      <span style="color: #fb4934;">break</span>;

    <span style="color: #fb4934;">case</span> <span style="color: #b8bb26;">'-'</span>:

      out = <span style="color: #b8bb26;">(</span>a - b<span style="color: #b8bb26;">)</span>;
      <span style="color: #fb4934;">break</span>;

    <span style="color: #fb4934;">case</span> <span style="color: #b8bb26;">'*'</span>:

      out = <span style="color: #b8bb26;">(</span>a * b<span style="color: #b8bb26;">)</span>;
      <span style="color: #fb4934;">break</span>;

    <span style="color: #fb4934;">case</span> <span style="color: #b8bb26;">'/'</span>:

      out = <span style="color: #b8bb26;">(</span>a / b<span style="color: #b8bb26;">)</span>;
      <span style="color: #fb4934;">break</span>;

  <span style="color: #cc241d;">}</span>

  printf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"Result: %.2f"</span>, out<span style="color: #cc241d;">)</span>;

  <span style="color: #fb4934;">return</span> <span style="color: #d3869b; font-weight: bold;">0</span>;
<span style="color: #fe8019;">}</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org0f26840" class="outline-3">
<h3 id="org0f26840"><span class="section-number-3">1.2.</span> Question 2: Sum of Even</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A program to find the sum of even numbers in a specific range.
</p>

<div class="org-src-container">
<pre class="src src-C">
<span style="color: #ebdbb2; font-weight: bold;">#include</span> <span style="color: #fe8019;">&lt;</span><span style="color: #b8bb26;">stdio.h</span><span style="color: #fe8019;">&gt;</span>

<span style="color: #fabd2f;">int</span> <span style="color: #b8bb26;">main</span><span style="color: #fe8019;">()</span> <span style="color: #fe8019;">{</span>

  <span style="color: #fabd2f;">int</span> <span style="color: #83a598;">n</span>, <span style="color: #83a598;">sum</span> = <span style="color: #d3869b; font-weight: bold;">0</span>, <span style="color: #83a598;">x</span> = <span style="color: #d3869b; font-weight: bold;">2</span>;

  printf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"Enter limit: "</span><span style="color: #cc241d;">)</span>;
  scanf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"%d"</span>, n<span style="color: #cc241d;">)</span>;

  <span style="color: #fb4934;">while</span> <span style="color: #cc241d;">(</span>x &lt;= n<span style="color: #cc241d;">)</span> <span style="color: #cc241d;">{</span>

    sum += x;
    x+= <span style="color: #d3869b; font-weight: bold;">2</span>;
  <span style="color: #cc241d;">}</span>

  printf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"The sum of even numbers: %d"</span>, sum<span style="color: #cc241d;">)</span>;

  <span style="color: #fb4934;">return</span> <span style="color: #d3869b; font-weight: bold;">0</span>;
<span style="color: #fe8019;">}</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgb0094ff" class="outline-3">
<h3 id="orgb0094ff"><span class="section-number-3">1.3.</span> Question 3: Triangle Pattern</h3>
<div class="outline-text-3" id="text-1-3">
<p>
A program to print out a triangle with a certain number of rows.
</p>

<div class="org-src-container">
<pre class="src src-C">
<span style="color: #ebdbb2; font-weight: bold;">#include</span> <span style="color: #fe8019;">&lt;</span><span style="color: #b8bb26;">stdio.h</span><span style="color: #fe8019;">&gt;</span>
<span style="color: #ebdbb2; font-weight: bold;">#define</span> <span style="color: #83a598;">new</span> printf<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"\n"</span><span style="color: #fe8019;">)</span>

<span style="color: #fabd2f;">int</span> <span style="color: #b8bb26;">main</span><span style="color: #fe8019;">()</span> <span style="color: #fe8019;">{</span>

  <span style="color: #fabd2f;">int</span> <span style="color: #83a598;">n</span>;

  printf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"Enter the number of rows: "</span><span style="color: #cc241d;">)</span>;
  scanf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"%d"</span>, &amp;n<span style="color: #cc241d;">)</span>;

  <span style="color: #fb4934;">for</span> <span style="color: #cc241d;">(</span><span style="color: #fabd2f;">int</span> <span style="color: #83a598;">x</span> = <span style="color: #d3869b; font-weight: bold;">0</span>; x &lt;= n; x++, new<span style="color: #cc241d;">)</span> <span style="color: #cc241d;">{</span>

    <span style="color: #fb4934;">for</span> <span style="color: #b8bb26;">(</span><span style="color: #fabd2f;">int</span> <span style="color: #83a598;">y</span> = <span style="color: #d3869b; font-weight: bold;">0</span>; y &lt;= x; y++<span style="color: #b8bb26;">)</span> <span style="color: #b8bb26;">{</span>

      printf<span style="color: #83a598;">(</span><span style="color: #b8bb26;">"*"</span><span style="color: #83a598;">)</span>;
    <span style="color: #b8bb26;">}</span>
  <span style="color: #cc241d;">}</span>

  <span style="color: #fb4934;">return</span> <span style="color: #d3869b; font-weight: bold;">0</span>;
<span style="color: #fe8019;">}</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org374c0bb" class="outline-3">
<h3 id="org374c0bb"><span class="section-number-3">1.4.</span> Question 4: Fibonacci Sequence</h3>
<div class="outline-text-3" id="text-1-4">
<p>
A program to print the first <code>n</code> numbers of the fibonacci sequence.
</p>

<div class="org-src-container">
<pre class="src src-C">
<span style="color: #ebdbb2; font-weight: bold;">#include</span> <span style="color: #fe8019;">&lt;</span><span style="color: #b8bb26;">stdio.h</span><span style="color: #fe8019;">&gt;</span>

<span style="color: #fabd2f;">int</span> <span style="color: #b8bb26;">main</span><span style="color: #fe8019;">()</span> <span style="color: #fe8019;">{</span>

  <span style="color: #fabd2f;">int</span> <span style="color: #83a598;">n</span>;

  printf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"Enter n: "</span><span style="color: #cc241d;">)</span>;
  scanf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"%d"</span>, &amp;n<span style="color: #cc241d;">)</span>;

  <span style="color: #fabd2f;">int</span> <span style="color: #83a598;">start</span> = <span style="color: #d3869b; font-weight: bold;">0</span>, <span style="color: #83a598;">mid</span> = <span style="color: #d3869b; font-weight: bold;">1</span>, <span style="color: #83a598;">end</span> = <span style="color: #d3869b; font-weight: bold;">0</span>;

  printf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"0, 1, "</span><span style="color: #cc241d;">)</span>;
  <span style="color: #fb4934;">for</span> <span style="color: #cc241d;">(</span><span style="color: #fabd2f;">int</span> <span style="color: #83a598;">x</span> = <span style="color: #d3869b; font-weight: bold;">3</span>; x &lt;= n; x++<span style="color: #cc241d;">)</span> <span style="color: #cc241d;">{</span>

    end = <span style="color: #b8bb26;">(</span>start + mid<span style="color: #b8bb26;">)</span>;
    start = mid; mid = end;

    <span style="color: #fb4934;">if</span> <span style="color: #b8bb26;">(</span>x != n<span style="color: #b8bb26;">)</span> <span style="color: #b8bb26;">{</span>

      printf<span style="color: #83a598;">(</span><span style="color: #b8bb26;">"%d, "</span>, end<span style="color: #83a598;">)</span>;
    <span style="color: #b8bb26;">}</span>
    <span style="color: #fb4934;">else</span> <span style="color: #b8bb26;">{</span>

      printf<span style="color: #83a598;">(</span><span style="color: #b8bb26;">"%d\n"</span>, end<span style="color: #83a598;">)</span>;
    <span style="color: #b8bb26;">}</span>
  <span style="color: #cc241d;">}</span>
  <span style="color: #fb4934;">return</span> <span style="color: #d3869b; font-weight: bold;">0</span>;
<span style="color: #fe8019;">}</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgcc38f76" class="outline-3">
<h3 id="orgcc38f76"><span class="section-number-3">1.5.</span> Question 5: Sum of Numbers</h3>
<div class="outline-text-3" id="text-1-5">
<p>
A program that splits an integer into each separate digit and sums them up.
</p>

<div class="org-src-container">
<pre class="src src-C">
<span style="color: #ebdbb2; font-weight: bold;">#include</span> <span style="color: #fe8019;">&lt;</span><span style="color: #b8bb26;">stdio.h</span><span style="color: #fe8019;">&gt;</span>

<span style="color: #fabd2f;">int</span> <span style="color: #b8bb26;">main</span><span style="color: #fe8019;">()</span> <span style="color: #fe8019;">{</span>

  <span style="color: #fabd2f;">int</span> <span style="color: #83a598;">n</span>, <span style="color: #83a598;">sum</span> = <span style="color: #d3869b; font-weight: bold;">0</span>, <span style="color: #83a598;">div</span> = <span style="color: #d3869b; font-weight: bold;">10</span>;
  <span style="color: #fabd2f;">float</span> <span style="color: #83a598;">fac</span>;

  printf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"Enter a number: "</span><span style="color: #cc241d;">)</span>;
  scanf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"%d"</span>, &amp;n<span style="color: #cc241d;">)</span>;

  <span style="color: #fb4934;">while</span> <span style="color: #cc241d;">(</span>n &gt; <span style="color: #d3869b; font-weight: bold;">0</span><span style="color: #cc241d;">)</span> <span style="color: #cc241d;">{</span>

    fac = <span style="color: #b8bb26;">(</span>n % div<span style="color: #b8bb26;">)</span>;
    sum += fac;
    n /= <span style="color: #d3869b; font-weight: bold;">10</span>;
  <span style="color: #cc241d;">}</span>

  printf<span style="color: #cc241d;">(</span><span style="color: #b8bb26;">"The sum of digits is: %d\n"</span>, sum<span style="color: #cc241d;">)</span>;

  <span style="color: #fb4934;">return</span> <span style="color: #d3869b; font-weight: bold;">0</span>;
<span style="color: #fe8019;">}</span>

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yahia Gaber</p>
<p class="date">Created: 2024-03-07 Thu 14:39</p>
</div>
</body>
</html>
